In [1]:
import pandas as pd

In [42]:
df1=pd.DataFrame([['a',1],['b',2]],columns=['letter','number'])
df1

  letter  number
0      a       1
1      b       2

In [43]:
df2=pd.DataFrame([['c',3],['d',4]],columns=['letter','number'])
df2

  letter  number
0      c       3
1      d       4

In [51]:
pd.concat([df1,df2],join='inner')

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [6]:
pd.concat([df1,df2],ignore_index=True)

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [7]:
pd.concat([df1,df2]).reset_index()

   index letter  number
0      0      a       1
1      1      b       2
2      0      c       3
3      1      d       4

In [8]:
aa=pd.concat([df1,df2]).reset_index()
aa=aa.drop(columns='index')
aa

  letter  number
0      a       1
1      b       2
2      c       3
3      d       4

In [9]:
df3 = pd.DataFrame([['c', 3, 'cat'], ['d', 4, 'dog']],
                    columns=['letter', 'number', 'animal'])
df3

  letter  number animal
0      c       3    cat
1      d       4    dog

In [10]:
df1

  letter  number
0      a       1
1      b       2

In [11]:
pd.concat([df1,df3])    #join=outer기준

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [44]:
pd.concat([df1,df3],sort=True)  #인덱스배열바뀜

  animal letter  number
0    NaN      a       1
1    NaN      b       2
0    cat      c       3
1    dog      d       4

In [13]:
pd.concat([df1,df3],sort=False)

  letter  number animal
0      a       1    NaN
1      b       2    NaN
0      c       3    cat
1      d       4    dog

In [45]:
pd.concat([df1,df3],join='inner')   #conat:세부옵션join 사용시 컬럼기준으로 뽑음 고정값 join='outer'
#원래는 join 행기준

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [16]:
df4 = pd.DataFrame([['bird', 'polly'], ['monkey', 'george']],
                    columns=['animal', 'name'])
df4

   animal    name
0    bird   polly
1  monkey  george

In [17]:
df1

  letter  number
0      a       1
1      b       2

In [18]:
pd.concat([df1,df4]) #df1의 컬럼 먼저 그다음 df2 컬럼
#sort 세부옵션 기본값 False

  letter  number  animal    name
0      a     1.0     NaN     NaN
1      b     2.0     NaN     NaN
0    NaN     NaN    bird   polly
1    NaN     NaN  monkey  george

In [19]:
pd.concat([df1,df4],sort=True)

   animal letter    name  number
0     NaN      a     NaN     1.0
1     NaN      b     NaN     2.0
0    bird    NaN   polly     NaN
1  monkey    NaN  george     NaN

In [20]:
pd.concat([df1,df4],sort=False)

  letter  number  animal    name
0      a     1.0     NaN     NaN
1      b     2.0     NaN     NaN
0    NaN     NaN    bird   polly
1    NaN     NaN  monkey  george

In [21]:
pd.concat([df1,df4],sort=False,axis=0)

  letter  number  animal    name
0      a     1.0     NaN     NaN
1      b     2.0     NaN     NaN
0    NaN     NaN    bird   polly
1    NaN     NaN  monkey  george

In [22]:
pd.concat([df1,df4],sort=False,axis=1)

  letter  number  animal    name
0      a       1    bird   polly
1      b       2  monkey  george

In [23]:
df5=pd.DataFrame([1],index=['a'])
df6=pd.DataFrame([2],index=['a'])
df5

   0
a  1

In [24]:
df6

   0
a  2

In [46]:
pd.concat([df5,df6])#axis=0이기에 행기준으로 병합 그리고 겹치는게 있으경우 밑으로

   0
a  1
a  2

In [26]:
pd.concat([df5,df6],axis=1)#axis=1기에 열기준으로 병합

   0  0
a  1  2

In [47]:
pd.concat([df5,df6],verify_integrity=False) #중복허용

   0
a  1
a  2

In [28]:
pd.concat([df5,df6],verify_integrity=True)

ValueError: Indexes have overlapping values: Index(['a'], dtype='object')

In [29]:
pd.concat([df1,df3],join='inner')

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [30]:
pd.concat([df1,df3],join='inner',verify_integrity=False)
#False이므로 중복허용

  letter  number
0      a       1
1      b       2
0      c       3
1      d       4

In [31]:
pd.concat([df1,df3],join='inner',verify_integrity=True)
#중복된 인덱스 가진 행 있으면 오류남
#Trued이면 중복허용 안됨->오류

ValueError: Indexes have overlapping values: Int64Index([0, 1], dtype='int64')

In [37]:
s1 = pd.Series(['a', 'b'])
s2 = pd.Series(['c', 'd'])
pd.concat([s1, s2])

0    a
1    b
0    c
1    d
dtype: object

In [38]:
s3=pd.concat([s1, s2],keys=['s1','s2'])
s3

s1  0    a
    1    b
s2  0    c
    1    d
dtype: object

In [39]:
s3.index

MultiIndex([('s1', 0),
            ('s1', 1),
            ('s2', 0),
            ('s2', 1)],
           )

In [40]:
s3.keys()

MultiIndex([('s1', 0),
            ('s1', 1),
            ('s2', 0),
            ('s2', 1)],
           )

In [41]:
pd.concat([s1, s2],keys=['s1','s2'],names=['Series name','Rown ID'])

Series name  Rown ID
s1           0          a
             1          b
s2           0          c
             1          d
dtype: object

pd.merde(rkqt1,rkqt2,how='inner',on,indicator=False)

머지는 공통된 열이 있어야 작동

, concat의 경우 how 이너와 아우터만 가능

adf.x1.isin(bdf.x1)

adf[~adf.x1.isin(bdf.x1)]

In [ ]:
pd.merge(udf,zdf,how='outer',indicator=True).query('_merge=="left_only"')